Revit 2017 API
AssetProperty Class
 Represents a property of material.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetProperty : IDisposable
Visual Basic
Public Class AssetProperty _
	Implements IDisposable
Visual C++
public ref class AssetProperty : IDisposable
Remarks
 AssetProperty is the base class or all other AssetProperty sub classes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetProperties
 Autodesk.Revit.Utility.AssetPropertyBoolean
 Autodesk.Revit.Utility.AssetPropertyDistance
 Autodesk.Revit.Utility.AssetPropertyDouble
 Autodesk.Revit.Utility.AssetPropertyDoubleArray2d
 Autodesk.Revit.Utility.AssetPropertyDoubleArray3d
 Autodesk.Revit.Utility.AssetPropertyDoubleArray4d
 Autodesk.Revit.Utility.AssetPropertyDoubleMatrix44
 Autodesk.Revit.Utility.AssetPropertyEnum
 Autodesk.Revit.Utility.AssetPropertyFloat
 Autodesk.Revit.Utility.AssetPropertyFloatArray
 Autodesk.Revit.Utility.AssetPropertyInt64
 Autodesk.Revit.Utility.AssetPropertyInteger
 Autodesk.Revit.Utility.AssetPropertyList
 Autodesk.Revit.Utility.AssetPropertyReference
 Autodesk.Revit.Utility.AssetPropertyString
 Autodesk.Revit.Utility.AssetPropertyTime
 Autodesk.Revit.Utility.AssetPropertyUInt64
See Also
AssetProperty Members
Autodesk.Revit.Utility Namespace